wengubing/agv_gd32h7/航发旧agv系统 stm32f4/AGV程序/CBB/user/hal_HardwareInterfaceIO/hal_STM32GPIO.h
/********************************** Copyright *********************************** 
  *
  *                           成都航发机器人有限公司
  *                            All Rights Reserved
  * 
  * FileName   : hal_STM32GPIO.h   
  * Version    : V1.0		
  * Author     : Master			
  * Date       : 2024.02.07
  * Description: 硬件抽象层IO接口模块依赖头文件
  *******************************************************************************/

#ifndef _HAL_STM32GPIO_H_
#define _HAL_STM32GPIO_H_

#include "STM32f4xx.h"
/*Gpio对象 管脚连接在开发板的位置*/
typedef enum
{
	/*全部的输入IO*/
		/*普通输入IO，无源输入，共计16个*/
		Cn56,
		Cn72,
		Cn57,
		Cn73,

		Cn58,
		Cn74,
		Cn61,
		Cn77,

		Cn62,
		Cn78,
		Cn63,
		Cn79,

		Cn64,
		Cn80,
		Cn65,
		Cn81,

		/*特殊输入IO，有源输入，共计4个*/
		Cn66,
		Cn67,
		Cn68,
		Cn69,

		/*4PIN端子；1脚电源 2脚GND 3、4脚 2路 输入IO*/
		Cn60_3,
		Cn60_4,
		Cn75_3,
		Cn75_4,
		Cn59_3,
		Cn59_4,
		Cn76_3,
		Cn76_4,

		/*13PIN端子；5路 输出IO、4路 输入IO；一般用作避障雷达*/

		Cn40_9,
		Cn40_10,
		Cn40_11,
		Cn40_12,

		Cn24_9,
		Cn24_10,
		Cn24_11,
		Cn24_12,

		/*15PIN端子；6路 输出IO、2路 输入IO*/

		Cn70_10,
		Cn70_11,

		Cn82_10,
		Cn82_11,

		Cn83_10,
		Cn83_11,

		Cn84_10,
		Cn84_11,
	
	/*单片机GPIO直接输出*/
		/*13PIN端子；5路 输出IO、4路 输入IO；一般用作避障雷达*/

		Cn40_5,
		Cn40_6,
		Cn40_7,

		Cn24_3,
		Cn24_4,
		Cn24_5,
		Cn24_6,
		Cn24_7,

		/*15PIN端子；6路 输出IO、2路 输入IO*/

		Cn70_5,
		Cn70_6,
		Cn70_7,
		Cn70_8,
		Cn70_9,

		Cn82_5,
		Cn82_6,
		Cn82_7,
		Cn82_8,
		Cn82_9,

		Cn83_5,
		Cn83_6,
		Cn83_7,
		Cn83_8,
		Cn83_9,

		Cn84_5,
		Cn84_6,
		Cn84_7,
		Cn84_8,
		Cn84_9,

		/*15PIN端子；6路 输出IO、2路 输入IO*/
		Cn70_3,

		Cn82_3,

		Cn83_3,

		Cn84_3,

	/*HC595扩展IO的GPIO，共计68个*/
		/*13PIN端子；5路 输出IO、4路 输入IO；一般用作避障雷达*/
		Cn40_4,	//Y32
		Cn40_3,	//Y33

		/*4PIN端子；3路 输出IO；一般用作三色灯*/
		Cn31_2,	//Y34
		Cn31_3,	//Y35

		
		/*普通输出IO，有源输出，共计28个*/
		Cn26,	//Y36
		Cn42,	//Y37
		Cn27,	//Y38
		Cn43,	//Y39

		Cn28,	//Y40
		Cn44,	//Y41
		Cn32,	//Y42
		Cn47,	//Y43

		Cn25,	//Y44
		Cn41,	//Y45
		Cn33,	//Y46
		Cn48,	//Y47

		Cn34,	//Y48
		Cn49,	//Y49
		Cn35,	//Y50
		Cn50,	//Y51
		
		Cn36,	//Y52
		Cn51,	//Y53
		Cn37,	//Y54
		Cn52,	//Y55

		Cn38,	//Y56
		Cn53,	//Y57
		Cn87,	//Y58
		Cn89,	//Y59

		/*4PIN端子；3路 输出IO；一般用作三色灯*/
		Cn46_2,	//Y60
		Cn46_3,	//Y61
		Cn46_4,	//Y62

		Cn31_4,	//Y63

		/*普通输出IO，有源输出，共计28个*/
		Cn45,	//Y64
		Cn29,	//Y65
		Cn90,	//Y66
		Cn88,	//Y67

		/*7PIN端子；4路 输出IO*/
		Cn30_3,	//Y68
		Cn30_4,	//Y69
		Cn30_5,	//Y70
		Cn30_6,	//Y71
		
		CnEnd,
}
_HalGpioNum_TypeDef;

/*Gpio对象芯片管脚到CN端子的映射关系 共计44管脚*/
/*x0-x7 暂不可用*/
#define		GPIO_CLK_CN24_12		RCC_AHB1Periph_GPIOE
#define		GPIO_PORT_CN24_12		GPIOE
#define		GPIO_PIN_CN24_12		GPIO_Pin_14
#define		GPIO_SOURCE_CN24_12		GPIO_PinSource14
#define		EXTI_PortSource_CN24_12	EXTI_PortSourceGPIOE
#define		EXTI_PinSource_CN24_12	EXTI_PinSource14

#define		GPIO_CLK_CN24_11		RCC_AHB1Periph_GPIOI
#define		GPIO_PORT_CN24_11		GPIOI
#define		GPIO_PIN_CN24_11		GPIO_Pin_11
#define		GPIO_SOURCE_CN24_11		GPIO_PinSource11
#define		EXTI_PortSource_CN24_11	EXTI_PortSourceGPIOI
#define		EXTI_PinSource_CN24_11	EXTI_PinSource11

#define		GPIO_CLK_CN24_10		RCC_AHB1Periph_GPIOD
#define		GPIO_PORT_CN24_10		GPIOD
#define		GPIO_PIN_CN24_10		GPIO_Pin_8
#define		GPIO_SOURCE_CN24_10		GPIO_PinSource8
#define		EXTI_PortSource_CN24_10	EXTI_PortSourceGPIOD
#define		EXTI_PinSource_CN24_10	EXTI_PinSource8

#define		GPIO_CLK_CN24_9			RCC_AHB1Periph_GPIOD
#define		GPIO_PORT_CN24_9		GPIOD
#define		GPIO_PIN_CN24_9			GPIO_Pin_11
#define		GPIO_SOURCE_CN24_9		GPIO_PinSource11
#define		EXTI_PortSource_CN24_9	EXTI_PortSourceGPIOD
#define		EXTI_PinSource_CN24_9	EXTI_PinSource11

#define		GPIO_CLK_CN40_9			RCC_AHB1Periph_GPIOD
#define		GPIO_PORT_CN40_9		GPIOD
#define		GPIO_PIN_CN40_9			GPIO_Pin_10
#define		GPIO_SOURCE_CN40_9		GPIO_PinSource10
#define		EXTI_PortSource_CN40_9	EXTI_PortSourceGPIOD
#define		EXTI_PinSource_CN40_9	EXTI_PinSource10

#define		GPIO_CLK_CN40_10		RCC_AHB1Periph_GPIOD
#define		GPIO_PORT_CN40_10		GPIOD
#define		GPIO_PIN_CN40_10		GPIO_Pin_9
#define		GPIO_SOURCE_CN40_10		GPIO_PinSource9
#define		EXTI_PortSource_CN40_10	EXTI_PortSourceGPIOD
#define		EXTI_PinSource_CN40_10	EXTI_PinSource9

#define		GPIO_CLK_CN40_11		RCC_AHB1Periph_GPIOG
#define		GPIO_PORT_CN40_11		GPIOG
#define		GPIO_PIN_CN40_11		GPIO_Pin_12
#define		GPIO_SOURCE_CN40_11		GPIO_PinSource12
#define		EXTI_PortSource_CN40_11	EXTI_PortSourceGPIOG
#define		EXTI_PinSource_CN40_11	EXTI_PinSource12

#define		GPIO_CLK_CN40_12		RCC_AHB1Periph_GPIOI
#define		GPIO_PORT_CN40_12		GPIOI
#define		GPIO_PIN_CN40_12		GPIO_Pin_3
#define		GPIO_SOURCE_CN40_12		GPIO_PinSource3
#define		EXTI_PortSource_CN40_12	EXTI_PortSourceGPIOI
#define		EXTI_PinSource_CN40_12	EXTI_PinSource3

#define		GPIO_CLK_CN56			RCC_AHB1Periph_GPIOG
#define		GPIO_PORT_CN56			GPIOG
#define		GPIO_PIN_CN56			GPIO_Pin_9
#define		GPIO_SOURCE_CN56		GPIO_PinSource9
#define		EXTI_PortSource_CN56	EXTI_PortSourceGPIOG
#define		EXTI_PinSource_CN56		EXTI_PinSource9

#define		GPIO_CLK_CN72			RCC_AHB1Periph_GPIOG
#define		GPIO_PORT_CN72			GPIOG
#define		GPIO_PIN_CN72			GPIO_Pin_10
#define		GPIO_SOURCE_CN72		GPIO_PinSource10
#define		EXTI_PortSource_CN72	EXTI_PortSourceGPIOG
#define		EXTI_PinSource_CN72		EXTI_PinSource10

#define		GPIO_CLK_CN57			RCC_AHB1Periph_GPIOG
#define		GPIO_PORT_CN57			GPIOG
#define		GPIO_PIN_CN57			GPIO_Pin_11
#define		GPIO_SOURCE_CN57		GPIO_PinSource11
#define		EXTI_PortSource_CN57	EXTI_PortSourceGPIOG
#define		EXTI_PinSource_CN57		EXTI_PinSource11

#define		GPIO_CLK_CN73			RCC_AHB1Periph_GPIOD
#define		GPIO_PORT_CN73			GPIOD
#define		GPIO_PIN_CN73			GPIO_Pin_7
#define		GPIO_SOURCE_CN73		GPIO_PinSource7
#define		EXTI_PortSource_CN73	EXTI_PortSourceGPIOD
#define		EXTI_PinSource_CN73		EXTI_PinSource7

#define		GPIO_CLK_CN59_3			RCC_AHB1Periph_GPIOI
#define		GPIO_PORT_CN59_3		GPIOI
#define		GPIO_PIN_CN59_3			GPIO_Pin_4
#define		GPIO_SOURCE_CN59_3		GPIO_PinSource4
#define		EXTI_PortSource_CN59_3	EXTI_PortSourceGPIOI
#define		EXTI_PinSource_CN59_3	EXTI_PinSource4

#define		GPIO_CLK_CN59_4			RCC_AHB1Periph_GPIOI
#define		GPIO_PORT_CN59_4		GPIOI
#define		GPIO_PIN_CN59_4			GPIO_Pin_5
#define		GPIO_SOURCE_CN59_4		GPIO_PinSource5
#define		EXTI_PortSource_CN59_4	EXTI_PortSourceGPIOI
#define		EXTI_PinSource_CN59_4	EXTI_PinSource5

#define		GPIO_CLK_CN75_3			RCC_AHB1Periph_GPIOI
#define		GPIO_PORT_CN75_3		GPIOI
#define		GPIO_PIN_CN75_3			GPIO_Pin_6
#define		GPIO_SOURCE_CN75_3		GPIO_PinSource6
#define		EXTI_PortSource_CN75_3	EXTI_PortSourceGPIOI
#define		EXTI_PinSource_CN75_3	EXTI_PinSource6

#define		GPIO_CLK_CN75_4			RCC_AHB1Periph_GPIOB
#define		GPIO_PORT_CN75_4		GPIOB
#define		GPIO_PIN_CN75_4			GPIO_Pin_7
#define		GPIO_SOURCE_CN75_4		GPIO_PinSource7
#define		EXTI_PortSource_CN75_4	EXTI_PortSourceGPIOB
#define		EXTI_PinSource_CN75_4	EXTI_PinSource7

