wengubing/agv_gd32h7/航发旧agv系统 stm32f4/AGV程序/CBB/user/hal_HardwareInterfaceIO/hal_STM32GPIO.h
#define		GPIO_CLK_CN60_3			RCC_AHB1Periph_GPIOD
#define		GPIO_PORT_CN60_3		GPIOD
#define		GPIO_PIN_CN60_3			GPIO_Pin_4
#define		GPIO_SOURCE_CN60_3		GPIO_PinSource4
#define		EXTI_PortSource_CN60_3	EXTI_PortSourceGPIOD
#define		EXTI_PinSource_CN60_3	EXTI_PinSource4

#define		GPIO_CLK_CN60_4			RCC_AHB1Periph_GPIOD
#define		GPIO_PORT_CN60_4		GPIOD
#define		GPIO_PIN_CN60_4			GPIO_Pin_5
#define		GPIO_SOURCE_CN60_4		GPIO_PinSource5
#define		EXTI_PortSource_CN60_4	EXTI_PortSourceGPIOD
#define		EXTI_PinSource_CN60_4	EXTI_PinSource5

#define		GPIO_CLK_CN76_3			RCC_AHB1Periph_GPIOD
#define		GPIO_PORT_CN76_3		GPIOD
#define		GPIO_PIN_CN76_3			GPIO_Pin_6
#define		GPIO_SOURCE_CN76_3		GPIO_PinSource6
#define		EXTI_PortSource_CN76_3	EXTI_PortSourceGPIOD
#define		EXTI_PinSource_CN76_3	EXTI_PinSource6

#define		GPIO_CLK_CN76_4			RCC_AHB1Periph_GPIOD
#define		GPIO_PORT_CN76_4		GPIOD
#define		GPIO_PIN_CN76_4			GPIO_Pin_3
#define		GPIO_SOURCE_CN76_4		GPIO_PinSource3
#define		EXTI_PortSource_CN76_4	EXTI_PortSourceGPIOD
#define		EXTI_PinSource_CN76_4	EXTI_PinSource3

#define		GPIO_CLK_CN58			RCC_AHB1Periph_GPIOD
#define		GPIO_PORT_CN58			GPIOD
#define		GPIO_PIN_CN58			GPIO_Pin_1
#define		GPIO_SOURCE_CN58		GPIO_PinSource1
#define		EXTI_PortSource_CN58	EXTI_PortSourceGPIOD
#define		EXTI_PinSource_CN58		EXTI_PinSource1

#define		GPIO_CLK_CN74			RCC_AHB1Periph_GPIOA
#define		GPIO_PORT_CN74			GPIOA
#define		GPIO_PIN_CN74			GPIO_Pin_15
#define		GPIO_SOURCE_CN74		GPIO_PinSource15
#define		EXTI_PortSource_CN74	EXTI_PortSourceGPIOA
#define		EXTI_PinSource_CN74		EXTI_PinSource15

#define		GPIO_CLK_CN61			RCC_AHB1Periph_GPIOH
#define		GPIO_PORT_CN61			GPIOH
#define		GPIO_PIN_CN61			GPIO_Pin_14
#define		GPIO_SOURCE_CN61		GPIO_PinSource14
#define		EXTI_PortSource_CN61	EXTI_PortSourceGPIOH
#define		EXTI_PinSource_CN61		EXTI_PinSource14

#define		GPIO_CLK_CN77			RCC_AHB1Periph_GPIOH
#define		GPIO_PORT_CN77			GPIOH
#define		GPIO_PIN_CN77			GPIO_Pin_13
#define		GPIO_SOURCE_CN77		GPIO_PinSource13
#define		EXTI_PortSource_CN77	EXTI_PortSourceGPIOH
#define		EXTI_PinSource_CN77		EXTI_PinSource13

#define		GPIO_CLK_CN62			RCC_AHB1Periph_GPIOA
#define		GPIO_PORT_CN62			GPIOA
#define		GPIO_PIN_CN62			GPIO_Pin_12
#define		GPIO_SOURCE_CN62		GPIO_PinSource12
#define		EXTI_PortSource_CN62	EXTI_PortSourceGPIOA
#define		EXTI_PinSource_CN62		EXTI_PinSource12

#define		GPIO_CLK_CN78			RCC_AHB1Periph_GPIOI
#define		GPIO_PORT_CN78			GPIOI
#define		GPIO_PIN_CN78			GPIO_Pin_1
#define		GPIO_SOURCE_CN78		GPIO_PinSource1
#define		EXTI_PortSource_CN78	EXTI_PortSourceGPIOI
#define		EXTI_PinSource_CN78		EXTI_PinSource1

#define		GPIO_CLK_CN63			RCC_AHB1Periph_GPIOI
#define		GPIO_PORT_CN63			GPIOI
#define		GPIO_PIN_CN63			GPIO_Pin_0
#define		GPIO_SOURCE_CN63		GPIO_PinSource0
#define		EXTI_PortSource_CN63	EXTI_PortSourceGPIOI
#define		EXTI_PinSource_CN63		EXTI_PinSource0

#define		GPIO_CLK_CN79			RCC_AHB1Periph_GPIOH
#define		GPIO_PORT_CN79			GPIOH
#define		GPIO_PIN_CN79			GPIO_Pin_15
#define		GPIO_SOURCE_CN79		GPIO_PinSource15
#define		EXTI_PortSource_CN79	EXTI_PortSourceGPIOH
#define		EXTI_PinSource_CN79		EXTI_PinSource15

#define		GPIO_CLK_CN64			RCC_AHB1Periph_GPIOG
#define		GPIO_PORT_CN64			GPIOG
#define		GPIO_PIN_CN64			GPIO_Pin_5
#define		GPIO_SOURCE_CN64		GPIO_PinSource5
#define		EXTI_PortSource_CN64	EXTI_PortSourceGPIOG
#define		EXTI_PinSource_CN64		EXTI_PinSource5

#define		GPIO_CLK_CN80			RCC_AHB1Periph_GPIOG
#define		GPIO_PORT_CN80			GPIOG
#define		GPIO_PIN_CN80			GPIO_Pin_4
#define		GPIO_SOURCE_CN80		GPIO_PinSource4
#define		EXTI_PortSource_CN80	EXTI_PortSourceGPIOG
#define		EXTI_PinSource_CN80		EXTI_PinSource4

#define		GPIO_CLK_CN65			RCC_AHB1Periph_GPIOG
#define		GPIO_PORT_CN65			GPIOG
#define		GPIO_PIN_CN65			GPIO_Pin_3
#define		GPIO_SOURCE_CN65		GPIO_PinSource3
#define		EXTI_PortSource_CN65	EXTI_PortSourceGPIOG
#define		EXTI_PinSource_CN65		EXTI_PinSource3

#define		GPIO_CLK_CN81			RCC_AHB1Periph_GPIOG
#define		GPIO_PORT_CN81			GPIOG
#define		GPIO_PIN_CN81			GPIO_Pin_8
#define		GPIO_SOURCE_CN81		GPIO_PinSource8
#define		EXTI_PortSource_CN81	EXTI_PortSourceGPIOG
#define		EXTI_PinSource_CN81		EXTI_PinSource8

#define		GPIO_CLK_CN66			RCC_AHB1Periph_GPIOG
#define		GPIO_PORT_CN66			GPIOG
#define		GPIO_PIN_CN66			GPIO_Pin_7
#define		GPIO_SOURCE_CN66		GPIO_PinSource7
#define		EXTI_PortSource_CN66	EXTI_PortSourceGPIOG
#define		EXTI_PinSource_CN66		EXTI_PinSource7

#define		GPIO_CLK_CN67			RCC_AHB1Periph_GPIOG
#define		GPIO_PORT_CN67			GPIOG
#define		GPIO_PIN_CN67			GPIO_Pin_6
#define		GPIO_SOURCE_CN67		GPIO_PinSource6
#define		EXTI_PortSource_CN67	EXTI_PortSourceGPIOG
#define		EXTI_PinSource_CN67		EXTI_PinSource6

#define		GPIO_CLK_CN68			RCC_AHB1Periph_GPIOE
#define		GPIO_PORT_CN68			GPIOE
#define		GPIO_PIN_CN68			GPIO_Pin_0
#define		GPIO_SOURCE_CN68		GPIO_PinSource0
#define		EXTI_PortSource_CN68	EXTI_PortSourceGPIOE
#define		EXTI_PinSource_CN68		EXTI_PinSource0

#define		GPIO_CLK_CN69			RCC_AHB1Periph_GPIOE
#define		GPIO_PORT_CN69			GPIOE
#define		GPIO_PIN_CN69			GPIO_Pin_1
#define		GPIO_SOURCE_CN69		GPIO_PinSource1
#define		EXTI_PortSource_CN69	EXTI_PortSourceGPIOE
#define		EXTI_PinSource_CN69		EXTI_PinSource1

#define		GPIO_CLK_CN70_10		RCC_AHB1Periph_GPIOE
#define		GPIO_PORT_CN70_10		GPIOE
#define		GPIO_PIN_CN70_10		GPIO_Pin_11
#define		GPIO_SOURCE_CN70_10		GPIO_PinSource11
#define		EXTI_PortSource_CN70_10	EXTI_PortSourceGPIOE
#define		EXTI_PinSource_CN70_10	EXTI_PinSource11

#define		GPIO_CLK_CN70_11		RCC_AHB1Periph_GPIOH
#define		GPIO_PORT_CN70_11		GPIOH
#define		GPIO_PIN_CN70_11		GPIO_Pin_6
#define		GPIO_SOURCE_CN70_11		GPIO_PinSource6
#define		EXTI_PortSource_CN70_11	EXTI_PortSourceGPIOH
#define		EXTI_PinSource_CN70_11	EXTI_PinSource6

#define		GPIO_CLK_CN82_10		RCC_AHB1Periph_GPIOE
#define		GPIO_PORT_CN82_10		GPIOE
#define		GPIO_PIN_CN82_10		GPIO_Pin_15	
#define		GPIO_SOURCE_CN82_10		GPIO_PinSource15
#define		EXTI_PortSource_CN82_10	EXTI_PortSourceGPIOE
#define		EXTI_PinSource_CN82_10	EXTI_PinSource15

#define		GPIO_CLK_CN82_11		RCC_AHB1Periph_GPIOE
#define		GPIO_PORT_CN82_11		GPIOE
#define		GPIO_PIN_CN82_11		GPIO_Pin_13
#define		GPIO_SOURCE_CN82_11		GPIO_PinSource13
#define		EXTI_PortSource_CN82_11	EXTI_PortSourceGPIOE
#define		EXTI_PinSource_CN82_11	EXTI_PinSource13

#define		GPIO_CLK_CN83_10		RCC_AHB1Periph_GPIOE
#define		GPIO_PORT_CN83_10		GPIOE
#define		GPIO_PIN_CN83_10		GPIO_Pin_12
#define		GPIO_SOURCE_CN83_10		GPIO_PinSource12
#define		EXTI_PortSource_CN83_10	EXTI_PortSourceGPIOE
#define		EXTI_PinSource_CN83_10	EXTI_PinSource12

#define		GPIO_CLK_CN83_11		RCC_AHB1Periph_GPIOI
#define		GPIO_PORT_CN83_11		GPIOI
#define		GPIO_PIN_CN83_11		GPIO_Pin_8
#define		GPIO_SOURCE_CN83_11		GPIO_PinSource8
#define		EXTI_PortSource_CN83_11	EXTI_PortSourceGPIOI
#define		EXTI_PinSource_CN83_11	EXTI_PinSource8

#define		GPIO_CLK_CN84_10		RCC_AHB1Periph_GPIOI
#define		GPIO_PORT_CN84_10		GPIOI
#define		GPIO_PIN_CN84_10		GPIO_Pin_9
#define		GPIO_SOURCE_CN84_10		GPIO_PinSource9
#define		EXTI_PortSource_CN84_10	EXTI_PortSourceGPIOI
#define		EXTI_PinSource_CN84_10	EXTI_PinSource9

#define		GPIO_CLK_CN84_11		RCC_AHB1Periph_GPIOI
#define		GPIO_PORT_CN84_11		GPIOI
#define		GPIO_PIN_CN84_11		GPIO_Pin_10
#define		GPIO_SOURCE_CN84_11		GPIO_PinSource10
#define		EXTI_PortSource_CN84_11	EXTI_PortSourceGPIOI
#define		EXTI_PinSource_CN84_11	EXTI_PinSource10

//输出引脚定义
#define		GPIO_CLK_CN70_5					RCC_AHB1Periph_GPIOF	
#define		GPIO_PORT_CN70_5					GPIOF	
#define		GPIO_PIN_CN70_5					GPIO_Pin_11	
#define		GPIO_SOURCE_CN70_5				GPIO_PinSource11		
								
#define		GPIO_CLK_CN70_6					RCC_AHB1Periph_GPIOF	
#define		GPIO_PORT_CN70_6					GPIOF	
#define		GPIO_PIN_CN70_6					GPIO_Pin_12	
#define		GPIO_SOURCE_CN70_6				GPIO_PinSource12		
								
