wengubing/agv_gd32h7/航发旧agv系统 stm32f4/AGV程序/CBB/user/hal_HardwareInterfaceIO/hal_STM32GPIO.h
#define		GPIO_CLK_CN70_7					RCC_AHB1Periph_GPIOG	
#define		GPIO_PORT_CN70_7					GPIOG	
#define		GPIO_PIN_CN70_7					GPIO_Pin_14	
#define		GPIO_SOURCE_CN70_7				GPIO_PinSource14		
								
#define		GPIO_CLK_CN70_8					RCC_AHB1Periph_GPIOF	
#define		GPIO_PORT_CN70_8					GPIOF	
#define		GPIO_PIN_CN70_8					GPIO_Pin_3
#define		GPIO_SOURCE_CN70_8				GPIO_PinSource3	
								
#define		GPIO_CLK_CN70_9					RCC_AHB1Periph_GPIOA	
#define		GPIO_PORT_CN70_9					GPIOA	
#define		GPIO_PIN_CN70_9					GPIO_Pin_4	
#define		GPIO_SOURCE_CN70_9				GPIO_PinSource4		
								
#define		GPIO_CLK_CN82_5					RCC_AHB1Periph_GPIOH	
#define		GPIO_PORT_CN82_5					GPIOH	
#define		GPIO_PIN_CN82_5					GPIO_Pin_4	
#define		GPIO_SOURCE_CN82_5				GPIO_PinSource4		
								
#define		GPIO_CLK_CN82_6					RCC_AHB1Periph_GPIOH	
#define		GPIO_PORT_CN82_6				GPIOH		
#define		GPIO_PIN_CN82_6					GPIO_Pin_10	
#define		GPIO_SOURCE_CN82_6				GPIO_PinSource10			
								
#define		GPIO_CLK_CN82_7					RCC_AHB1Periph_GPIOG	
#define		GPIO_PORT_CN82_7				GPIOG		
#define		GPIO_PIN_CN82_7					GPIO_Pin_13	
#define		GPIO_SOURCE_CN82_7				GPIO_PinSource13			
								
#define		GPIO_CLK_CN82_8					RCC_AHB1Periph_GPIOG	
#define		GPIO_PORT_CN82_8				GPIOG		
#define		GPIO_PIN_CN82_8					GPIO_Pin_0	
#define		GPIO_SOURCE_CN82_8				GPIO_PinSource0			
								
#define		GPIO_CLK_CN82_9					RCC_AHB1Periph_GPIOF	
#define		GPIO_PORT_CN82_9				GPIOF		
#define		GPIO_PIN_CN82_9					GPIO_Pin_15	
#define		GPIO_SOURCE_CN82_9				GPIO_PinSource15			
								
#define		GPIO_CLK_CN83_5					RCC_AHB1Periph_GPIOF	
#define		GPIO_PORT_CN83_5				GPIOF		
#define		GPIO_PIN_CN83_5					GPIO_Pin_14	
#define		GPIO_SOURCE_CN83_5				GPIO_PinSource14			
								
#define		GPIO_CLK_CN83_6					RCC_AHB1Periph_GPIOF	
#define		GPIO_PORT_CN83_6				GPIOF		
#define		GPIO_PIN_CN83_6					GPIO_Pin_13	
#define		GPIO_SOURCE_CN83_6				GPIO_PinSource13			
								
#define		GPIO_CLK_CN83_7					RCC_AHB1Periph_GPIOI	
#define		GPIO_PORT_CN83_7				GPIOI		
#define		GPIO_PIN_CN83_7					GPIO_Pin_2	
#define		GPIO_SOURCE_CN83_7				GPIO_PinSource2			
								
#define		GPIO_CLK_CN83_8					RCC_AHB1Periph_GPIOG	
#define		GPIO_PORT_CN83_8				GPIOG		
#define		GPIO_PIN_CN83_8					GPIO_Pin_1	
#define		GPIO_SOURCE_CN83_8				GPIO_PinSource1			
								
#define		GPIO_CLK_CN83_9					RCC_AHB1Periph_GPIOE	
#define		GPIO_PORT_CN83_9				GPIOE		
#define		GPIO_PIN_CN83_9					GPIO_Pin_7	
#define		GPIO_SOURCE_CN83_9				GPIO_PinSource7			
								
#define		GPIO_CLK_CN84_5					RCC_AHB1Periph_GPIOH	
#define		GPIO_PORT_CN84_5				GPIOH		
#define		GPIO_PIN_CN84_5					GPIO_Pin_5	
#define		GPIO_SOURCE_CN84_5				GPIO_PinSource5			
								
#define		GPIO_CLK_CN84_6					RCC_AHB1Periph_GPIOE	
#define		GPIO_PORT_CN84_6				GPIOE		
#define		GPIO_PIN_CN84_6					GPIO_Pin_8	
#define		GPIO_SOURCE_CN84_6				GPIO_PinSource8			
								
#define		GPIO_CLK_CN84_7					RCC_AHB1Periph_GPIOF	
#define		GPIO_PORT_CN84_7				GPIOF		
#define		GPIO_PIN_CN84_7					GPIO_Pin_2
#define		GPIO_SOURCE_CN84_7				GPIO_PinSource2
								
#define		GPIO_CLK_CN84_8					RCC_AHB1Periph_GPIOE	
#define		GPIO_PORT_CN84_8				GPIOE		
#define		GPIO_PIN_CN84_8					GPIO_Pin_9	
#define		GPIO_SOURCE_CN84_8				GPIO_PinSource9			
								
#define		GPIO_CLK_CN84_9					RCC_AHB1Periph_GPIOH	
#define		GPIO_PORT_CN84_9				GPIOH		
#define		GPIO_PIN_CN84_9					GPIO_Pin_2	
#define		GPIO_SOURCE_CN84_9				GPIO_PinSource2			
								
#define		GPIO_CLK_CN24_6					RCC_AHB1Periph_GPIOH	
#define		GPIO_PORT_CN24_6				GPIOH		
#define		GPIO_PIN_CN24_6					GPIO_Pin_3	
#define		GPIO_SOURCE_CN24_6				GPIO_PinSource3			
								
#define		GPIO_CLK_CN24_5					RCC_AHB1Periph_GPIOH	
#define		GPIO_PORT_CN24_5				GPIOH		
#define		GPIO_PIN_CN24_5					GPIO_Pin_9	
#define		GPIO_SOURCE_CN24_5				GPIO_PinSource9			
								
#define		GPIO_CLK_CN24_4					RCC_AHB1Periph_GPIOH	
#define		GPIO_PORT_CN24_4				GPIOH		
#define		GPIO_PIN_CN24_4					GPIO_Pin_8	
#define		GPIO_SOURCE_CN24_4				GPIO_PinSource8			
								
#define		GPIO_CLK_CN24_3					RCC_AHB1Periph_GPIOH	
#define		GPIO_PORT_CN24_3				GPIOH		
#define		GPIO_PIN_CN24_3					GPIO_Pin_7	
#define		GPIO_SOURCE_CN24_3				GPIO_PinSource7			
								
#define		GPIO_CLK_CN24_7					RCC_AHB1Periph_GPIOG	
#define		GPIO_PORT_CN24_7				GPIOG		
#define		GPIO_PIN_CN24_7					GPIO_Pin_2	
#define		GPIO_SOURCE_CN24_7				GPIO_PinSource2			
								
#define		GPIO_CLK_CN40_7					RCC_AHB1Periph_GPIOD	
#define		GPIO_PORT_CN40_7				GPIOD		
#define		GPIO_PIN_CN40_7					GPIO_Pin_15	
#define		GPIO_SOURCE_CN40_7				GPIO_PinSource15			
								
#define		GPIO_CLK_CN40_6					RCC_AHB1Periph_GPIOD	
#define		GPIO_PORT_CN40_6				GPIOD		
#define		GPIO_PIN_CN40_6					GPIO_Pin_14	
#define		GPIO_SOURCE_CN40_6				GPIO_PinSource14			
								
#define		GPIO_CLK_CN40_5					RCC_AHB1Periph_GPIOE	
#define		GPIO_PORT_CN40_5				GPIOE		
#define		GPIO_PIN_CN40_5					GPIO_Pin_10	
#define		GPIO_SOURCE_CN40_5				GPIO_PinSource10	

/*HC595扩展IO占位使用*/
	#define		GPIO_CLK_CN28					RCC_AHB1Periph_GPIOE	
	#define		GPIO_PORT_CN28					GPIOE		
	#define		GPIO_PIN_CN28					GPIO_Pin_10	
	#define		GPIO_SOURCE_CN28				GPIO_PinSource10	

	#define		GPIO_CLK_CN44					RCC_AHB1Periph_GPIOE	
	#define		GPIO_PORT_CN44					GPIOE		
	#define		GPIO_PIN_CN44					GPIO_Pin_10	
	#define		GPIO_SOURCE_CN44				GPIO_PinSource10	

	#define		GPIO_CLK_CN32					RCC_AHB1Periph_GPIOE	
	#define		GPIO_PORT_CN32					GPIOE		
	#define		GPIO_PIN_CN32					GPIO_Pin_10	
	#define		GPIO_SOURCE_CN32				GPIO_PinSource10	

	#define		GPIO_CLK_CN47					RCC_AHB1Periph_GPIOE	
	#define		GPIO_PORT_CN47					GPIOE
	#define		GPIO_PIN_CN47					GPIO_Pin_10
	#define		GPIO_SOURCE_CN47				GPIO_PinSource10

	#define		GPIO_CLK_CN43					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN43					GPIOE
	#define		GPIO_PIN_CN43					GPIO_Pin_10
	#define		GPIO_SOURCE_CN43				GPIO_PinSource10

	#define		GPIO_CLK_CN27					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN27					GPIOE
	#define		GPIO_PIN_CN27					GPIO_Pin_10
	#define		GPIO_SOURCE_CN27				GPIO_PinSource10

	#define		GPIO_CLK_CN42					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN42					GPIOE
	#define		GPIO_PIN_CN42					GPIO_Pin_10
	#define		GPIO_SOURCE_CN42				GPIO_PinSource10

	#define		GPIO_CLK_CN26					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN26					GPIOE
	#define		GPIO_PIN_CN26					GPIO_Pin_10
	#define		GPIO_SOURCE_CN26				GPIO_PinSource10

	#define		GPIO_CLK_CN34					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN34					GPIOE
	#define		GPIO_PIN_CN34					GPIO_Pin_10
	#define		GPIO_SOURCE_CN34				GPIO_PinSource10

