wengubing/agv_gd32h7/航发旧agv系统 stm32f4/AGV程序/CBB/user/hal_HardwareInterfaceIO/hal_STM32GPIO.h
	#define		GPIO_CLK_CN49					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN49					GPIOE
	#define		GPIO_PIN_CN49					GPIO_Pin_10
	#define		GPIO_SOURCE_CN49				GPIO_PinSource10

	#define		GPIO_CLK_CN35					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN35					GPIOE
	#define		GPIO_PIN_CN35					GPIO_Pin_10
	#define		GPIO_SOURCE_CN35				GPIO_PinSource10

	#define		GPIO_CLK_CN50					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN50					GPIOE
	#define		GPIO_PIN_CN50					GPIO_Pin_10
	#define		GPIO_SOURCE_CN50				GPIO_PinSource10

	#define		GPIO_CLK_CN48					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN48					GPIOE
	#define		GPIO_PIN_CN48					GPIO_Pin_10
	#define		GPIO_SOURCE_CN48				GPIO_PinSource10

	#define		GPIO_CLK_CN33					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN33					GPIOE
	#define		GPIO_PIN_CN33					GPIO_Pin_10
	#define		GPIO_SOURCE_CN33				GPIO_PinSource10

	#define		GPIO_CLK_CN41					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN41					GPIOE
	#define		GPIO_PIN_CN41					GPIO_Pin_10
	#define		GPIO_SOURCE_CN41				GPIO_PinSource10

	#define		GPIO_CLK_CN25					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN25					GPIOE
	#define		GPIO_PIN_CN25					GPIO_Pin_10
	#define		GPIO_SOURCE_CN25				GPIO_PinSource10

	#define		GPIO_CLK_CN38					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN38					GPIOE
	#define		GPIO_PIN_CN38					GPIO_Pin_10
	#define		GPIO_SOURCE_CN38				GPIO_PinSource10

	#define		GPIO_CLK_CN53					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN53					GPIOE
	#define		GPIO_PIN_CN53					GPIO_Pin_10
	#define		GPIO_SOURCE_CN53				GPIO_PinSource10

	#define		GPIO_CLK_CN87					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN87					GPIOE
	#define		GPIO_PIN_CN87					GPIO_Pin_10
	#define		GPIO_SOURCE_CN87				GPIO_PinSource10

	#define		GPIO_CLK_CN89					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN89					GPIOE
	#define		GPIO_PIN_CN89					GPIO_Pin_10
	#define		GPIO_SOURCE_CN89				GPIO_PinSource10

	#define		GPIO_CLK_CN52					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN52					GPIOE
	#define		GPIO_PIN_CN52					GPIO_Pin_10
	#define		GPIO_SOURCE_CN52				GPIO_PinSource10

	#define		GPIO_CLK_CN37					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN37					GPIOE
	#define		GPIO_PIN_CN37					GPIO_Pin_10
	#define		GPIO_SOURCE_CN37				GPIO_PinSource10

	#define		GPIO_CLK_CN51					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN51					GPIOE
	#define		GPIO_PIN_CN51					GPIO_Pin_10
	#define		GPIO_SOURCE_CN51				GPIO_PinSource10

	#define		GPIO_CLK_CN36					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN36					GPIOE
	#define		GPIO_PIN_CN36					GPIO_Pin_10
	#define		GPIO_SOURCE_CN36				GPIO_PinSource10

	#define		GPIO_CLK_CN88					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN88					GPIOE
	#define		GPIO_PIN_CN88					GPIO_Pin_10
	#define		GPIO_SOURCE_CN88				GPIO_PinSource10

	#define		GPIO_CLK_CN90					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN90					GPIOE
	#define		GPIO_PIN_CN90					GPIO_Pin_10
	#define		GPIO_SOURCE_CN90				GPIO_PinSource10

	#define		GPIO_CLK_CN29					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN29					GPIOE
	#define		GPIO_PIN_CN29					GPIO_Pin_10
	#define		GPIO_SOURCE_CN29				GPIO_PinSource10

	#define		GPIO_CLK_CN45					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN45					GPIOE
	#define		GPIO_PIN_CN45					GPIO_Pin_10
	#define		GPIO_SOURCE_CN45				GPIO_PinSource10

	#define		GPIO_CLK_CN30_3					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN30_3				GPIOE
	#define		GPIO_PIN_CN30_3					GPIO_Pin_10
	#define		GPIO_SOURCE_CN30_3				GPIO_PinSource10

	#define		GPIO_CLK_CN30_4					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN30_4				GPIOE
	#define		GPIO_PIN_CN30_4					GPIO_Pin_10
	#define		GPIO_SOURCE_CN30_4				GPIO_PinSource10

	#define		GPIO_CLK_CN30_5					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN30_5				GPIOE
	#define		GPIO_PIN_CN30_5					GPIO_Pin_10
	#define		GPIO_SOURCE_CN30_5				GPIO_PinSource10

	#define		GPIO_CLK_CN30_6					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN30_6				GPIOE
	#define		GPIO_PIN_CN30_6					GPIO_Pin_10
	#define		GPIO_SOURCE_CN30_6				GPIO_PinSource10

	#define		GPIO_CLK_CN31_2					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN31_2				GPIOE
	#define		GPIO_PIN_CN31_2					GPIO_Pin_10
	#define		GPIO_SOURCE_CN31_2				GPIO_PinSource10

	#define		GPIO_CLK_CN31_3					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN31_3				GPIOE
	#define		GPIO_PIN_CN31_3					GPIO_Pin_10
	#define		GPIO_SOURCE_CN31_3				GPIO_PinSource10

	#define		GPIO_CLK_CN31_4					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN31_4				GPIOE
	#define		GPIO_PIN_CN31_4					GPIO_Pin_10
	#define		GPIO_SOURCE_CN31_4				GPIO_PinSource10

	#define		GPIO_CLK_CN46_2					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN46_2				GPIOE
	#define		GPIO_PIN_CN46_2					GPIO_Pin_10
	#define		GPIO_SOURCE_CN46_2				GPIO_PinSource10

	#define		GPIO_CLK_CN46_3					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN46_3				GPIOE
	#define		GPIO_PIN_CN46_3					GPIO_Pin_10
	#define		GPIO_SOURCE_CN46_3				GPIO_PinSource10

	#define		GPIO_CLK_CN46_4					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN46_4				GPIOE
	#define		GPIO_PIN_CN46_4					GPIO_Pin_10
	#define		GPIO_SOURCE_CN46_4				GPIO_PinSource10

	#define		GPIO_CLK_CN40_3					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN40_3				GPIOE
	#define		GPIO_PIN_CN40_3					GPIO_Pin_10
	#define		GPIO_SOURCE_CN40_3				GPIO_PinSource10

	#define		GPIO_CLK_CN40_4					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN40_4				GPIOE
	#define		GPIO_PIN_CN40_4					GPIO_Pin_10
	#define		GPIO_SOURCE_CN40_4				GPIO_PinSource10

	#define		GPIO_CLK_CN70_3					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN70_3				GPIOE
	#define		GPIO_PIN_CN70_3					GPIO_Pin_10
	#define		GPIO_SOURCE_CN70_3				GPIO_PinSource10

	#define		GPIO_CLK_CN82_3					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN82_3				GPIOE
	#define		GPIO_PIN_CN82_3					GPIO_Pin_10
	#define		GPIO_SOURCE_CN82_3				GPIO_PinSource10

	#define		GPIO_CLK_CN83_3					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN83_3				GPIOE
	#define		GPIO_PIN_CN83_3					GPIO_Pin_10
	#define		GPIO_SOURCE_CN83_3				GPIO_PinSource10

	#define		GPIO_CLK_CN84_3					RCC_AHB1Periph_GPIOE
	#define		GPIO_PORT_CN84_3				GPIOE
	#define		GPIO_PIN_CN84_3					GPIO_Pin_10
	#define		GPIO_SOURCE_CN84_3				GPIO_PinSource10
/*HC595扩展IO占位结束*/

