wengubing/agv_gd32h7/航发旧agv系统 stm32f4/AGV程序/CBB/user/hal_HardwareInterfaceIO/hal_STM32GPIO.h
/*HC595扩展IO的GPIO相关定义*/
#ifndef  EXT595_NUM
	//扩展IO输出的数量
	#define		EXTIO_CNT							40
	#define		EXT595_NUM							5
	//595串行输入引脚
	#define		EXTIO_CLK_SI						RCC_AHB1Periph_GPIOG
	#define		EXTIO_PORT_SI						GPIOG		
	#define		EXTIO_PIN_SI						GPIO_Pin_15	
	#define		EXTIO_SOURCE_SI						GPIO_PinSource15		
	//595锁存存储器时钟输入引脚
	#define		EXTIO_CLK_RCK						RCC_AHB1Periph_GPIOB
	#define		EXTIO_PORT_RCK						GPIOB
	#define		EXTIO_PIN_RCK						GPIO_Pin_3
	#define		EXTIO_SOURCE_RCK					GPIO_PinSource3
	//595数据移位时钟输入引脚
	#define		EXTIO_CLK_SCK						RCC_AHB1Periph_GPIOB
	#define		EXTIO_PORT_SCK						GPIOB		
	#define		EXTIO_PIN_SCK						GPIO_Pin_6
	#define		EXTIO_SOURCE_SCK					GPIO_PinSource6
	//595数据使能输出引脚                                                                  
	#define		EXTIO_CLK_OE    					RCC_AHB1Periph_GPIOE
	#define		EXTIO_PORT_OE   					GPIOE		
	#define		EXTIO_PIN_OE					    GPIO_Pin_5
	#define		EXTIO_SOURCE_OE				        GPIO_PinSource5

	//EXTGPIO状态控制宏定义
	#define		SI_L										(EXTIO_PORT_SI->BSRRH=EXTIO_PIN_SI)	//置"0"
	#define		SI_H										(EXTIO_PORT_SI->BSRRL=EXTIO_PIN_SI)	//置"1"

	#define		OE_L										(EXTIO_PORT_OE->BSRRH=EXTIO_PIN_OE)
	#define		OE_H										(EXTIO_PORT_OE->BSRRL=EXTIO_PIN_OE)

	#define		RCK_L										(EXTIO_PORT_RCK->BSRRH=EXTIO_PIN_RCK)
	#define		RCK_H										(EXTIO_PORT_RCK->BSRRL=EXTIO_PIN_RCK)

	#define		SCK_L										(EXTIO_PORT_SCK->BSRRH=EXTIO_PIN_SCK)
	#define		SCK_H										(EXTIO_PORT_SCK->BSRRL=EXTIO_PIN_SCK)
#endif
/***********************************************************************************/


/*按位输出的GPIO相关定义，HC595扩展IO时会用上*/
#ifndef  YOUT_LS_BIT_NUM
	/*输出状态定义*/
	#define		RW_BIT_YOUT_STATUS					3 	//Y4-Y71,占用68bit,给5个uint16_t缓存即可
	#define		YOUT_LS_BIT_NUM						68
	#define		YOUT_DHR_NUM_LS						5
	//高速输出(可配置位PWM脉冲或数字频率输出)
	#define		B48												48	 //Y0
	#define		B49												49	 //Y1
	#define		B50												50	 //Y2
	#define		B51												51	 //Y3	
	//驱动电机使用专用位(Y4-Y23)
	#define		B52												52	 //Y4  //使能信号1:启动/停止输入-0:启动,1:停止
	#define		B53												53	 //Y5
	#define		B54												54	 //Y6  //制动刹车信号1:运行/急停brake输入-0:运行，1:瞬时停止
	#define		B55												55	 //Y7  //旋转方向切信号1-1:顺CW,0:逆CCW
	#define		B56												56	 //Y8
	#define		B57												57	 //Y9  //使能信号2:启动/停止输入-0:启动,1:停止
	#define		B58												58	 //Y10
	#define		B59												59	 //Y11 //制动刹车信号2:运行/急停brake输入-0:运行，1:瞬时停止
	#define		B60												60	 //Y12 //旋转方向切信号2-1:顺CW,0:逆CCW
	#define		B61												61	 //Y13
	#define		B62												62	 //Y14 //使能信号3:启动/停止输入-0:启动,1:停止
	#define		B63												63	 //Y15
	#define		B64												64	 //Y16 //制动刹车信号3:运行/急停brake输入-0:运行，1:瞬时停止
	#define		B65												65	 //Y17 //旋转方向切信号3-1:顺CW,0:逆CCW
	#define		B66												66	 //Y18
	#define		B67												67	 //Y19 //使能信号4:启动/停止输入-0:启动,1:停止
	#define		B68												68	 //Y20
	#define		B69												69	 //Y21 //制动刹车信号4:运行/急停brake输入-0:运行，1:瞬时停止
	#define		B70												70	 //Y22 //旋转方向切信号4-1:顺CW,0:逆CCW
	#define		B71												71	 //Y23
	//普通Yx输出位
	#define		B72												72	 //Y24
	#define		B73												73	 //Y25
	#define		B74												74	 //Y26
	#define		B75												75	 //Y27
	#define		B76												76	 //Y28
	#define		B77												77	 //Y29
	#define		B78												78	 //Y30
	#define		B79												79	 //Y31
	#define		B80												80	 //Y32		----595
	#define		B81												81	 //Y33
	#define		B82												82	 //Y34
	#define		B83												83	 //Y35
	#define		B84												84	 //Y36
	#define		B85												85	 //Y37
	#define		B86												86	 //Y38
	#define		B87												87	 //Y39
	#define		B88												88	 //Y40 CN28 第一个垃圾控制
	#define		B89												89	 //Y41
	#define		B90												90	 //Y42
	#define		B91												91	 //Y43
	#define		B92												92	 //Y44
	#define		B93												93	 //Y45
	#define		B94												94	 //Y46
	#define		B95												95	 //Y47
	#define		B96												96	 //Y48
	#define		B97												97	 //Y49
	#define		B98												98	 //Y50
	#define		B99												99	 //Y51
	#define		B100											100	 //Y52
	#define		B101											101	 //Y53
	#define		B102											102	 //Y54
	#define		B103											103	 //Y55
	#define		B104											104	 //Y56
	#define		B105											105	 //Y57
	#define		B106											106	 //Y58
	#define		B107											107	 //Y59
	#define		B108											108	 //Y60
	#define		B109											109	 //Y61
	#define		B110											110	 //Y62
	#define		B111											111	 //Y63
	#define		B112											112	 //Y64
	#define		B113											113	 //Y65
	#define		B114											114	 //Y66
	#define		B115											115	 //Y67
	#define		B116											116	 //Y68
	#define		B117											117	 //Y69
	#define		B118											118	 //Y70
	#define		B119											119	 //Y71 CN30-6备用垃圾控制
	#define		B120											120	 //全开
	#define		B121											121	 //全关
#endif
/***********************************************************************************/

/***********************************************************************************/
/*全部的输入IO*/
const uint32_t	 CN_CLK_IN	= 
		GPIO_PIN_CN56|
		GPIO_PIN_CN72|
		GPIO_PIN_CN57|
		GPIO_PIN_CN73|

		GPIO_PIN_CN58|
		GPIO_PIN_CN74|
		GPIO_PIN_CN61|
		GPIO_PIN_CN77|

		GPIO_PIN_CN62|
		GPIO_PIN_CN78|
		GPIO_PIN_CN63|
		GPIO_PIN_CN79|

		GPIO_PIN_CN64|
		GPIO_PIN_CN80|
		GPIO_PIN_CN65|
		GPIO_PIN_CN81|

		/*特殊输入IO，有源输入，共计4个*/
		GPIO_PIN_CN66|
		GPIO_PIN_CN67|
		GPIO_PIN_CN68|
		GPIO_PIN_CN69|

		/*4PIN端子；1脚电源 2脚GND 3、4脚 2路 输入IO*/
		GPIO_PIN_CN60_3|
		GPIO_PIN_CN60_4|
		GPIO_PIN_CN75_3|
		GPIO_PIN_CN75_4|
		GPIO_PIN_CN59_3|
		GPIO_PIN_CN59_4|
		GPIO_PIN_CN76_3|
		GPIO_PIN_CN76_4|

		/*13PIN端子；5路 输出IO、4路 输入IO；一般用作避障雷达*/

		GPIO_PIN_CN40_9|
		GPIO_PIN_CN40_10|
		GPIO_PIN_CN40_11|
		GPIO_PIN_CN40_12|

		GPIO_PIN_CN24_9|
		GPIO_PIN_CN24_10|
		GPIO_PIN_CN24_11|
		GPIO_PIN_CN24_12|

		/*15PIN端子；6路 输出IO、2路 输入IO*/

		GPIO_PIN_CN70_10|
		GPIO_PIN_CN70_11|

		GPIO_PIN_CN82_10|
		GPIO_PIN_CN82_11|

		GPIO_PIN_CN83_10|
		GPIO_PIN_CN83_11|

		GPIO_PIN_CN84_10|
		GPIO_PIN_CN84_11;
/***********************************************************************************/

/*单片机GPIO直接输出*/
const uint32_t	 CN_CLK_OUT	= 
		/*13PIN端子；5路 输出IO、4路 输入IO；一般用作避障雷达*/
		GPIO_PIN_CN40_5|
		GPIO_PIN_CN40_6|
		GPIO_PIN_CN40_7|

		GPIO_PIN_CN24_3|
		GPIO_PIN_CN24_4|
		GPIO_PIN_CN24_5|
		GPIO_PIN_CN24_6|
		GPIO_PIN_CN24_7|

