wengubing/agv_gd32h7/航发旧agv系统 stm32f4/AGV程序/CBB/user/hal_HardwareInterfaceIO/hal_STM32GPIO.h
		/*15PIN端子；6路 输出IO、2路 输入IO*/
		GPIO_PIN_CN70_5|
		GPIO_PIN_CN70_6|
		GPIO_PIN_CN70_7|
		GPIO_PIN_CN70_8|
		GPIO_PIN_CN70_9|

		GPIO_PIN_CN82_5|
		GPIO_PIN_CN82_6|
		GPIO_PIN_CN82_7|
		GPIO_PIN_CN82_8|
		GPIO_PIN_CN82_9|

		GPIO_PIN_CN83_5|
		GPIO_PIN_CN83_6|
		GPIO_PIN_CN83_7|
		GPIO_PIN_CN83_8|
		GPIO_PIN_CN83_9|

		GPIO_PIN_CN84_5|
		GPIO_PIN_CN84_6|
		GPIO_PIN_CN84_7|
		GPIO_PIN_CN84_8|
		GPIO_PIN_CN84_9;
/***********************************************************************************/

/*全部的CN的Port列表*/
GPIO_TypeDef    *CN_PORT[CnEnd]	= {
	/*全部的输入IO*/
		/*普通输入IO，无源输入，共计16个*/
		GPIO_PORT_CN56,
		GPIO_PORT_CN72,
		GPIO_PORT_CN57,
		GPIO_PORT_CN73,

		GPIO_PORT_CN58,
		GPIO_PORT_CN74,
		GPIO_PORT_CN61,
		GPIO_PORT_CN77,

		GPIO_PORT_CN62,
		GPIO_PORT_CN78,
		GPIO_PORT_CN63,
		GPIO_PORT_CN79,

		GPIO_PORT_CN64,
		GPIO_PORT_CN80,
		GPIO_PORT_CN65,
		GPIO_PORT_CN81,

		/*特殊输入IO，有源输入，共计4个*/
		GPIO_PORT_CN66,
		GPIO_PORT_CN67,
		GPIO_PORT_CN68,
		GPIO_PORT_CN69,

		/*4PIN端子；1脚电源 2脚GND 3、4脚 2路 输入IO*/
		GPIO_PORT_CN60_3,
		GPIO_PORT_CN60_4,
		GPIO_PORT_CN75_3,
		GPIO_PORT_CN75_4,
		GPIO_PORT_CN59_3,
		GPIO_PORT_CN59_4,
		GPIO_PORT_CN76_3,
		GPIO_PORT_CN76_4,

		/*13PIN端子；5路 输出IO、4路 输入IO；一般用作避障雷达*/

		GPIO_PORT_CN40_9,
		GPIO_PORT_CN40_10,
		GPIO_PORT_CN40_11,
		GPIO_PORT_CN40_12,

		GPIO_PORT_CN24_9,
		GPIO_PORT_CN24_10,
		GPIO_PORT_CN24_11,
		GPIO_PORT_CN24_12,

		/*15PIN端子；6路 输出IO、2路 输入IO*/

		GPIO_PORT_CN70_10,
		GPIO_PORT_CN70_11,

		GPIO_PORT_CN82_10,
		GPIO_PORT_CN82_11,

		GPIO_PORT_CN83_10,
		GPIO_PORT_CN83_11,

		GPIO_PORT_CN84_10,
		GPIO_PORT_CN84_11,
	
	/*单片机GPIO直接输出*/
		/*13PIN端子；5路 输出IO、4路 输入IO；一般用作避障雷达*/

		GPIO_PORT_CN40_5,
		GPIO_PORT_CN40_6,
		GPIO_PORT_CN40_7,

		GPIO_PORT_CN24_3,
		GPIO_PORT_CN24_4,
		GPIO_PORT_CN24_5,
		GPIO_PORT_CN24_6,
		GPIO_PORT_CN24_7,

		/*15PIN端子；6路 输出IO、2路 输入IO*/

		GPIO_PORT_CN70_5,
		GPIO_PORT_CN70_6,
		GPIO_PORT_CN70_7,
		GPIO_PORT_CN70_8,
		GPIO_PORT_CN70_9,

		GPIO_PORT_CN82_5,
		GPIO_PORT_CN82_6,
		GPIO_PORT_CN82_7,
		GPIO_PORT_CN82_8,
		GPIO_PORT_CN82_9,

		GPIO_PORT_CN83_5,
		GPIO_PORT_CN83_6,
		GPIO_PORT_CN83_7,
		GPIO_PORT_CN83_8,
		GPIO_PORT_CN83_9,

		GPIO_PORT_CN84_5,
		GPIO_PORT_CN84_6,
		GPIO_PORT_CN84_7,
		GPIO_PORT_CN84_8,
		GPIO_PORT_CN84_9,

		/*15PIN端子；6路 输出IO、2路 输入IO*/
		GPIO_PORT_CN70_3,

		GPIO_PORT_CN82_3,

		GPIO_PORT_CN83_3,

		GPIO_PORT_CN84_3,

	/*HC595扩展IO的GPIO，共计68个*/
		/*13PIN端子；5路 输出IO、4路 输入IO；一般用作避障雷达*/
		GPIO_PORT_CN40_4,	//Y32
		GPIO_PORT_CN40_3,	//Y33

		/*4PIN端子；3路 输出IO；一般用作三色灯*/
		GPIO_PORT_CN31_2,	//Y34
		GPIO_PORT_CN31_3,	//Y35

		
		/*普通输出IO，有源输出，共计28个*/
		GPIO_PORT_CN26,	//Y36
		GPIO_PORT_CN42,	//Y37
		GPIO_PORT_CN27,	//Y38
		GPIO_PORT_CN43,	//Y39

		GPIO_PORT_CN28,	//Y40
		GPIO_PORT_CN44,	//Y41
		GPIO_PORT_CN32,	//Y42
		GPIO_PORT_CN47,	//Y43

		GPIO_PORT_CN25,	//Y44
		GPIO_PORT_CN41,	//Y45
		GPIO_PORT_CN33,	//Y46
		GPIO_PORT_CN48,	//Y47

		GPIO_PORT_CN34,	//Y48
		GPIO_PORT_CN49,	//Y49
		GPIO_PORT_CN35,	//Y50
		GPIO_PORT_CN50,	//Y51
		
		GPIO_PORT_CN36,	//Y52
		GPIO_PORT_CN51,	//Y53
		GPIO_PORT_CN37,	//Y54
		GPIO_PORT_CN52,	//Y55

		GPIO_PORT_CN38,	//Y56
		GPIO_PORT_CN53,	//Y57
		GPIO_PORT_CN87,	//Y58
		GPIO_PORT_CN89,	//Y59

		/*4PIN端子；3路 输出IO；一般用作三色灯*/
		GPIO_PORT_CN46_2,	//Y60
		GPIO_PORT_CN46_3,	//Y61
		GPIO_PORT_CN46_4,	//Y62

		GPIO_PORT_CN31_4,	//Y63

		/*普通输出IO，有源输出，共计28个*/
		GPIO_PORT_CN45,	//Y64
		GPIO_PORT_CN29,	//Y65
		GPIO_PORT_CN90,	//Y66
		GPIO_PORT_CN88,	//Y67

		/*7PIN端子；4路 输出IO*/
		GPIO_PORT_CN30_3,	//Y68
		GPIO_PORT_CN30_4,	//Y69
		GPIO_PORT_CN30_5,	//Y70
		GPIO_PORT_CN30_6,	//Y71
};

/*全部的CN的Pin列表*/
const uint32_t	 CN_PIN[CnEnd]	= {
	/*全部的输入IO*/
		/*普通输入IO，无源输入，共计16个*/
		GPIO_PIN_CN56,
		GPIO_PIN_CN72,
		GPIO_PIN_CN57,
		GPIO_PIN_CN73,

		GPIO_PIN_CN58,
		GPIO_PIN_CN74,
		GPIO_PIN_CN61,
		GPIO_PIN_CN77,

		GPIO_PIN_CN62,
		GPIO_PIN_CN78,
		GPIO_PIN_CN63,
		GPIO_PIN_CN79,

		GPIO_PIN_CN64,
		GPIO_PIN_CN80,
		GPIO_PIN_CN65,
		GPIO_PIN_CN81,

		/*特殊输入IO，有源输入，共计4个*/
		GPIO_PIN_CN66,
		GPIO_PIN_CN67,
		GPIO_PIN_CN68,
		GPIO_PIN_CN69,

		/*4PIN端子；1脚电源 2脚GND 3、4脚 2路 输入IO*/
		GPIO_PIN_CN60_3,
		GPIO_PIN_CN60_4,
		GPIO_PIN_CN75_3,
		GPIO_PIN_CN75_4,
		GPIO_PIN_CN59_3,
		GPIO_PIN_CN59_4,
		GPIO_PIN_CN76_3,
		GPIO_PIN_CN76_4,

		/*13PIN端子；5路 输出IO、4路 输入IO；一般用作避障雷达*/

		GPIO_PIN_CN40_9,
		GPIO_PIN_CN40_10,
		GPIO_PIN_CN40_11,
		GPIO_PIN_CN40_12,

		GPIO_PIN_CN24_9,
		GPIO_PIN_CN24_10,
		GPIO_PIN_CN24_11,
		GPIO_PIN_CN24_12,

		/*15PIN端子；6路 输出IO、2路 输入IO*/

		GPIO_PIN_CN70_10,
		GPIO_PIN_CN70_11,

		GPIO_PIN_CN82_10,
		GPIO_PIN_CN82_11,

		GPIO_PIN_CN83_10,
		GPIO_PIN_CN83_11,

		GPIO_PIN_CN84_10,
		GPIO_PIN_CN84_11,

	/*单片机GPIO直接输出*/
		/*13PIN端子；5路 输出IO、4路 输入IO；一般用作避障雷达*/

		GPIO_PIN_CN40_5,
		GPIO_PIN_CN40_6,
		GPIO_PIN_CN40_7,

		GPIO_PIN_CN24_3,
		GPIO_PIN_CN24_4,
		GPIO_PIN_CN24_5,
		GPIO_PIN_CN24_6,
		GPIO_PIN_CN24_7,

		/*15PIN端子；6路 输出IO、2路 输入IO*/

		GPIO_PIN_CN70_5,
		GPIO_PIN_CN70_6,
		GPIO_PIN_CN70_7,
		GPIO_PIN_CN70_8,
		GPIO_PIN_CN70_9,

		GPIO_PIN_CN82_5,
		GPIO_PIN_CN82_6,
		GPIO_PIN_CN82_7,
		GPIO_PIN_CN82_8,
		GPIO_PIN_CN82_9,

		GPIO_PIN_CN83_5,
		GPIO_PIN_CN83_6,
		GPIO_PIN_CN83_7,
		GPIO_PIN_CN83_8,
		GPIO_PIN_CN83_9,

		GPIO_PIN_CN84_5,
		GPIO_PIN_CN84_6,
		GPIO_PIN_CN84_7,
		GPIO_PIN_CN84_8,
		GPIO_PIN_CN84_9,

		/*15PIN端子；6路 输出IO、2路 输入IO*/
		GPIO_PIN_CN70_3,

		GPIO_PIN_CN82_3,

		GPIO_PIN_CN83_3,

		GPIO_PIN_CN84_3,

	/*HC595扩展IO的GPIO，共计68个*/
		/*13PIN端子；5路 输出IO、4路 输入IO；一般用作避障雷达*/
		GPIO_PIN_CN40_4,	//Y32
		GPIO_PIN_CN40_3,	//Y33

		/*4PIN端子；3路 输出IO；一般用作三色灯*/
		GPIO_PIN_CN31_2,	//Y34
		GPIO_PIN_CN31_3,	//Y35

		
		/*普通输出IO，有源输出，共计28个*/
		GPIO_PIN_CN26,	//Y36
		GPIO_PIN_CN42,	//Y37
		GPIO_PIN_CN27,	//Y38
		GPIO_PIN_CN43,	//Y39

		GPIO_PIN_CN28,	//Y40
		GPIO_PIN_CN44,	//Y41
		GPIO_PIN_CN32,	//Y42
		GPIO_PIN_CN47,	//Y43

		GPIO_PIN_CN25,	//Y44
		GPIO_PIN_CN41,	//Y45
		GPIO_PIN_CN33,	//Y46
		GPIO_PIN_CN48,	//Y47

		GPIO_PIN_CN34,	//Y48
		GPIO_PIN_CN49,	//Y49
		GPIO_PIN_CN35,	//Y50
		GPIO_PIN_CN50,	//Y51
		
		GPIO_PIN_CN36,	//Y52
		GPIO_PIN_CN51,	//Y53
		GPIO_PIN_CN37,	//Y54
		GPIO_PIN_CN52,	//Y55

		GPIO_PIN_CN38,	//Y56
		GPIO_PIN_CN53,	//Y57
		GPIO_PIN_CN87,	//Y58
		GPIO_PIN_CN89,	//Y59

		/*4PIN端子；3路 输出IO；一般用作三色灯*/
		GPIO_PIN_CN46_2,	//Y60
		GPIO_PIN_CN46_3,	//Y61
		GPIO_PIN_CN46_4,	//Y62

		GPIO_PIN_CN31_4,	//Y63

