wengubing/agv_gd32h7/航发旧agv系统 stm32f4/AGV程序/CBB/user/hal_HardwareInterfaceIO/hal_STM32GPIO.h
		/*普通输出IO，有源输出，共计28个*/
		GPIO_PIN_CN45,	//Y64
		GPIO_PIN_CN29,	//Y65
		GPIO_PIN_CN90,	//Y66
		GPIO_PIN_CN88,	//Y67

		/*7PIN端子；4路 输出IO*/
		GPIO_PIN_CN30_3,	//Y68
		GPIO_PIN_CN30_4,	//Y69
		GPIO_PIN_CN30_5,	//Y70
		GPIO_PIN_CN30_6,	//Y71

};




/*HC595扩展IO的GPIO 对应的硬件编号，共计68个*/
const uint32_t	 HC595_PIN[]	= {
		/*HC595扩展IO的GPIO，共计68个*/
		/*13PIN端子；5路 输出IO、4路 输入IO；一般用作避障雷达*/
		B88,		//Cn40_4,	//Y32
		B88,		//Cn40_3,	//Y33

		/*4PIN端子；3路 输出IO；一般用作三色灯*/
		B88,		//Cn31_2,	//Y34
		B88,		//Cn31_3,	//Y35

		
		/*普通输出IO，有源输出，共计28个*/
		B88,		//Cn26,	//Y36
		B88,		//Cn42,	//Y37
		B88,		//Cn27,	//Y38
		B88,		//Cn43,	//Y39

		B88,		//Cn28,	//Y40
		B88,		//Cn44,	//Y41
		B88,		//Cn32,	//Y42
		B88,		//Cn47,	//Y43

		B88,		//Cn25,	//Y44
		B88,		//Cn41,	//Y45
		B88,		//Cn33,	//Y46
		B88,		//Cn48,	//Y47

		B88,		//Cn34,	//Y48
		B88,		//Cn49,	//Y49
		B88,		//Cn35,	//Y50
		B88,		//Cn50,	//Y51
		
		B88,		//Cn36,	//Y52
		B88,		//Cn51,	//Y53
		B88,		//Cn37,	//Y54
		B88,		//Cn52,	//Y55

		B88,		//Cn38,	//Y56
		B88,		//Cn53,	//Y57
		B88,		//Cn87,	//Y58
		B88,		//Cn89,	//Y59

		/*4PIN端子；3路 输出IO；一般用作三色灯*/
		B88,		//Cn46_2,	//Y60
		B88,		//Cn46_3,	//Y61
		B88,		//Cn46_4,	//Y62

		B88,		//Cn31_4,	//Y63

		/*普通输出IO，有源输出，共计28个*/
		B88,		//Cn45,	//Y64
		B88,		//Cn29,	//Y65
		B88,		//Cn90,	//Y66
		B88,		//Cn88,	//Y67

		/*7PIN端子；4路 输出IO*/
		B88,		//Cn30_3,	//Y68
		B88,		//Cn30_4,	//Y69
		B88,		//Cn30_5,	//Y70
		B88,		//Cn30_6,	//Y71
};


#endif

/************************************END OF FILE************************************/
